In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Object Creation

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967
2013-01-02 -1.199818  1.172105 -0.409437  2.097556
2013-01-03 -0.972570  1.429964  0.135350 -0.121326
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552

In [5]:
df2=pd.DataFrame({'A':1.,
                  'B':pd.Timestamp('20130102'),
                  'C':pd.Series(1,index=list(range(4)),dtype='float32'),
                  'D':np.array([3]*4,dtype='int32'),
                  'E':pd.Categorical(['test','train','test','train']),
                  'F':'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [6]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Viewing Data

In [7]:
df.head()

                   A         B         C         D
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967
2013-01-02 -1.199818  1.172105 -0.409437  2.097556
2013-01-03 -0.972570  1.429964  0.135350 -0.121326
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189

In [8]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -1.011553 -0.269810 -0.207476 -0.200843
std    0.826471  1.517078  1.080761  1.325313
min   -1.554434 -2.613559 -1.232648 -1.564552
25%   -1.505953 -1.026760 -0.856849 -1.135383
50%   -1.311216 -0.173586 -0.485739 -0.138147
75%   -1.029382  0.873895 -0.000847 -0.030017
max    0.613854  1.429964  1.779039  2.097556

In [9]:
df.tail(3)

                   A         B         C         D
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
np.array(df)

array([[ 6.13853510e-01, -2.07342758e-02, -1.23264772e+00,
        -1.54966791e-01],
       [-1.19981785e+00,  1.17210463e+00, -4.09437079e-01,
         2.09755622e+00],
       [-9.72570145e-01,  1.42996361e+00,  1.35350215e-01,
        -1.21326317e-01],
       [-1.42261376e+00, -2.61355858e+00, -9.55118609e-01,
         4.19914018e-04],
       [-1.55443424e+00, -3.26437639e-01,  1.77903913e+00,
        -1.46218861e+00],
       [-1.53373285e+00, -1.26020024e+00, -5.62041836e-01,
        -1.56455192e+00]])

In [12]:
np.array(df2)

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.613854   -1.199818   -0.972570   -1.422614   -1.554434   -1.533733
B   -0.020734    1.172105    1.429964   -2.613559   -0.326438   -1.260200
C   -1.232648   -0.409437    0.135350   -0.955119    1.779039   -0.562042
D   -0.154967    2.097556   -0.121326    0.000420   -1.462189   -1.564552

In [14]:
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -0.154967 -1.232648 -0.020734  0.613854
2013-01-02  2.097556 -0.409437  1.172105 -1.199818
2013-01-03 -0.121326  0.135350  1.429964 -0.972570
2013-01-04  0.000420 -0.955119 -2.613559 -1.422614
2013-01-05 -1.462189  1.779039 -0.326438 -1.554434
2013-01-06 -1.564552 -0.562042 -1.260200 -1.533733

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967
2013-01-02 -1.199818  1.172105 -0.409437  2.097556
2013-01-03 -0.972570  1.429964  0.135350 -0.121326

# Selection

In [16]:
df['A']

2013-01-01    0.613854
2013-01-02   -1.199818
2013-01-03   -0.972570
2013-01-04   -1.422614
2013-01-05   -1.554434
2013-01-06   -1.533733
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967
2013-01-02 -1.199818  1.172105 -0.409437  2.097556
2013-01-03 -0.972570  1.429964  0.135350 -0.121326

In [18]:
df['2013-01-02':'2013-01-04']

                   A         B         C         D
2013-01-02 -1.199818  1.172105 -0.409437  2.097556
2013-01-03 -0.972570  1.429964  0.135350 -0.121326
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420

**Selection by Label**

In [19]:
df.loc[dates[0]]

A    0.613854
B   -0.020734
C   -1.232648
D   -0.154967
Name: 2013-01-01 00:00:00, dtype: float64

In [20]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  0.613854 -0.020734
2013-01-02 -1.199818  1.172105
2013-01-03 -0.972570  1.429964
2013-01-04 -1.422614 -2.613559
2013-01-05 -1.554434 -0.326438
2013-01-06 -1.533733 -1.260200

In [21]:
df.loc['2013-01-02':'2013-01-04',['A','B']]

                   A         B
2013-01-02 -1.199818  1.172105
2013-01-03 -0.972570  1.429964
2013-01-04 -1.422614 -2.613559

In [22]:
df.loc['2013-01-03',['A','B']]

A   -0.972570
B    1.429964
Name: 2013-01-03 00:00:00, dtype: float64

In [23]:
df.loc[dates[0],'A']

0.613853509698264

In [24]:
df.at[dates[0],'A']

0.613853509698264

**Selection by Position**

In [25]:
df.iloc[3]

A   -1.422614
B   -2.613559
C   -0.955119
D    0.000420
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.422614 -2.613559
2013-01-05 -1.554434 -0.326438

In [27]:
df.iloc[[1,2,3],[0,2]]

                   A         C
2013-01-02 -1.199818 -0.409437
2013-01-03 -0.972570  0.135350
2013-01-04 -1.422614 -0.955119

In [28]:
df.iloc[:,0:3]

                   A         B         C
2013-01-01  0.613854 -0.020734 -1.232648
2013-01-02 -1.199818  1.172105 -0.409437
2013-01-03 -0.972570  1.429964  0.135350
2013-01-04 -1.422614 -2.613559 -0.955119
2013-01-05 -1.554434 -0.326438  1.779039
2013-01-06 -1.533733 -1.260200 -0.562042

In [29]:
df.iloc[1,1]

1.172104628988394

In [30]:
df.iat[1,1]

1.172104628988394

**Boolean Indexing**

In [31]:
df[df.A>0]

                   A         B         C         D
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967

In [32]:
df[df>0]

                   A         B         C         D
2013-01-01  0.613854       NaN       NaN       NaN
2013-01-02       NaN  1.172105       NaN  2.097556
2013-01-03       NaN  1.429964  0.135350       NaN
2013-01-04       NaN       NaN       NaN  0.000420
2013-01-05       NaN       NaN  1.779039       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [33]:
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967    one
2013-01-02 -1.199818  1.172105 -0.409437  2.097556    one
2013-01-03 -0.972570  1.429964  0.135350 -0.121326    two
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420  three
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189   four
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552  three

In [34]:
# isin
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.972570  1.429964  0.135350 -0.121326   two
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189  four

**Setting**

In [35]:
s1=pd.Series(range(1,7),index=pd.date_range('2013-01-02',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [36]:
df['F']=s1
df

                   A         B         C         D    F
2013-01-01  0.613854 -0.020734 -1.232648 -0.154967  NaN
2013-01-02 -1.199818  1.172105 -0.409437  2.097556  1.0
2013-01-03 -0.972570  1.429964  0.135350 -0.121326  2.0
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420  3.0
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189  4.0
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552  5.0

In [37]:
df.at[dates[0],'A']=0
df.iat[0,1]=0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000 -1.232648 -0.154967  NaN
2013-01-02 -1.199818  1.172105 -0.409437  2.097556  1.0
2013-01-03 -0.972570  1.429964  0.135350 -0.121326  2.0
2013-01-04 -1.422614 -2.613559 -0.955119  0.000420  3.0
2013-01-05 -1.554434 -0.326438  1.779039 -1.462189  4.0
2013-01-06 -1.533733 -1.260200 -0.562042 -1.564552  5.0

In [38]:
df.loc[:,'D']=np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.232648  5  NaN
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0
2013-01-03 -0.972570  1.429964  0.135350  5  2.0
2013-01-04 -1.422614 -2.613559 -0.955119  5  3.0
2013-01-05 -1.554434 -0.326438  1.779039  5  4.0
2013-01-06 -1.533733 -1.260200 -0.562042  5  5.0

In [39]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.232648 -5  NaN
2013-01-02 -1.199818 -1.172105 -0.409437 -5 -1.0
2013-01-03 -0.972570 -1.429964 -0.135350 -5 -2.0
2013-01-04 -1.422614 -2.613559 -0.955119 -5 -3.0
2013-01-05 -1.554434 -0.326438 -1.779039 -5 -4.0
2013-01-06 -1.533733 -1.260200 -0.562042 -5 -5.0

# Missing Data

In [40]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.232648  5  NaN  1.0
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0  1.0
2013-01-03 -0.972570  1.429964  0.135350  5  2.0  NaN
2013-01-04 -1.422614 -2.613559 -0.955119  5  3.0  NaN

In [41]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0  1.0

In [42]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -1.232648  5  5.0  1.0
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0  1.0
2013-01-03 -0.972570  1.429964  0.135350  5  2.0  5.0
2013-01-04 -1.422614 -2.613559 -0.955119  5  3.0  5.0

In [43]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations

**Stats**

In [44]:
# 
df.mean()

A   -1.113861
B   -0.266355
C   -0.207476
D    5.000000
F    3.000000
dtype: float64

In [45]:
# 
df.mean(1)

2013-01-01    0.941838
2013-01-02    1.112570
2013-01-03    1.518549
2013-01-04    0.601742
2013-01-05    1.779633
2013-01-06    1.328805
Freq: D, dtype: float64

In [46]:
s = pd.Series([1,3,5,np.nan,6,8],index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [49]:
# 
df.sub(s,axis='index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.972570  0.429964 -0.864650  4.0  1.0
2013-01-04 -4.422614 -5.613559 -3.955119  2.0  0.0
2013-01-05 -6.554434 -5.326438 -3.220961  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [48]:
df.at[dates[0], 'A'] = 0
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.232648  5  NaN
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0
2013-01-03 -0.972570  1.429964  0.135350  5  2.0
2013-01-04 -1.422614 -2.613559 -0.955119  5  3.0
2013-01-05 -1.554434 -0.326438  1.779039  5  4.0
2013-01-06 -1.533733 -1.260200 -0.562042  5  5.0

# Apply

In [51]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.232648  5  NaN
2013-01-02 -1.199818  1.172105 -0.409437  5  1.0
2013-01-03 -0.972570  1.429964  0.135350  5  2.0
2013-01-04 -1.422614 -2.613559 -0.955119  5  3.0
2013-01-05 -1.554434 -0.326438  1.779039  5  4.0
2013-01-06 -1.533733 -1.260200 -0.562042  5  5.0

In [52]:
# 
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000 -1.232648   5   NaN
2013-01-02 -1.199818  1.172105 -1.642085  10   1.0
2013-01-03 -2.172388  2.602068 -1.506735  15   3.0
2013-01-04 -3.595002 -0.011490 -2.461853  20   6.0
2013-01-05 -5.149436 -0.337928 -0.682814  25  10.0
2013-01-06 -6.683169 -1.598128 -1.244856  30  15.0

In [56]:
df.apply(lambda x:x.max()-x.min())

A    1.554434
B    4.043522
C    3.011687
D    0.000000
F    4.000000
dtype: float64

# Histogramming

In [57]:
s = pd.Series(np.random.randint(0,7,size=10))
s

0    5
1    4
2    6
3    5
4    2
5    2
6    3
7    5
8    4
9    5
dtype: int32

In [58]:
# 
s.value_counts()

5    4
4    2
2    2
6    1
3    1
dtype: int64

In [61]:
s = pd.Series(['A', 'B', 'C', 'Abab', 'Bas', np.nan, 'CA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    abab
4     bas
5     NaN
6      ca
7     dog
8     cat
dtype: object

# Merge

**concat**

In [63]:
df=pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0 -0.912983  1.157536  0.293115  1.366836
1  1.109837  0.571214  0.023386 -1.583287
2 -0.082128 -0.959411 -0.514818  0.187774
3 -0.461327  0.551666 -0.033289  0.353077
4 -2.654677  0.218717 -1.201895  0.267553
5  0.182609 -1.528196  0.120979  1.349205
6 -1.219298 -0.055411 -1.871022 -0.770780
7 -3.051636  1.464285  0.489254  0.133137
8 -1.731783 -0.844870  1.117155 -0.248157
9 -0.677128 -0.375775  0.371676  1.013532

In [64]:
pieces=[df[:3],df[3:7],df[7:]]
pieces

[          0         1         2         3
 0 -0.912983  1.157536  0.293115  1.366836
 1  1.109837  0.571214  0.023386 -1.583287
 2 -0.082128 -0.959411 -0.514818  0.187774,
           0         1         2         3
 3 -0.461327  0.551666 -0.033289  0.353077
 4 -2.654677  0.218717 -1.201895  0.267553
 5  0.182609 -1.528196  0.120979  1.349205
 6 -1.219298 -0.055411 -1.871022 -0.770780,
           0         1         2         3
 7 -3.051636  1.464285  0.489254  0.133137
 8 -1.731783 -0.844870  1.117155 -0.248157
 9 -0.677128 -0.375775  0.371676  1.013532]

In [65]:
# 
pd.concat(pieces)

          0         1         2         3
0 -0.912983  1.157536  0.293115  1.366836
1  1.109837  0.571214  0.023386 -1.583287
2 -0.082128 -0.959411 -0.514818  0.187774
3 -0.461327  0.551666 -0.033289  0.353077
4 -2.654677  0.218717 -1.201895  0.267553
5  0.182609 -1.528196  0.120979  1.349205
6 -1.219298 -0.055411 -1.871022 -0.770780
7 -3.051636  1.464285  0.489254  0.133137
8 -1.731783 -0.844870  1.117155 -0.248157
9 -0.677128 -0.375775  0.371676  1.013532

# Join

In [66]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [67]:
left

   key  lval
0  foo     1
1  foo     2

In [68]:
right

   key  rval
0  foo     4
1  foo     5

In [70]:
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

**Append**

In [71]:
df = pd.DataFrame(np.random.randn(8, 4), columns=list('ABCD'))
df

          A         B         C         D
0 -0.012782 -0.472147 -0.267239  0.952741
1  0.316149 -0.650179 -1.047319 -2.227110
2  1.158982 -0.485375  3.007985  1.364805
3  0.919973  1.184867 -0.035914 -2.549259
4 -1.383030  0.010150  0.532355  1.352252
5 -0.933990  0.106542  0.597289  0.674198
6 -0.559654 -0.444644  0.950675 -0.719159
7 -1.080791  0.556198 -0.611857 -0.590320

In [75]:
s = df.iloc[3]
s

A    0.919973
B    1.184867
C   -0.035914
D   -2.549259
Name: 3, dtype: float64

In [74]:
# ignore_indexFalse,index
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.012782 -0.472147 -0.267239  0.952741
1  0.316149 -0.650179 -1.047319 -2.227110
2  1.158982 -0.485375  3.007985  1.364805
3  0.919973  1.184867 -0.035914 -2.549259
4 -1.383030  0.010150  0.532355  1.352252
5 -0.933990  0.106542  0.597289  0.674198
6 -0.559654 -0.444644  0.950675 -0.719159
7 -1.080791  0.556198 -0.611857 -0.590320
8  0.919973  1.184867 -0.035914 -2.549259

# Grouping

By group by we are referring to a process involving one or more of the following steps:

-Splitting the data into groups based on some criteria

-Applying a function to each group independently

-Combining the results into a data structure

In [76]:
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
    'B': ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
    'C':
    np.random.randn(8),
    'D':
    np.random.randn(8)
})
df

     A      B         C         D
0  foo    one  0.173600 -0.410601
1  bar    one  1.070365 -0.128711
2  foo    two -0.276815  1.204317
3  bar  three  0.572660 -1.779449
4  foo    two  2.181589  1.779093
5  bar    two -0.678854  0.645565
6  foo    one  1.311036 -0.104204
7  foo  three  1.354112 -0.868805

In [78]:
df.groupby('A').sum()

            C         D
A
bar  0.964172 -1.262596
foo  4.743521  1.599799

In [79]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.070365 -0.128711
    three  0.572660 -1.779449
    two   -0.678854  0.645565
foo one    1.484635 -0.514805
    three  1.354112 -0.868805
    two    1.904773  2.983409

In [83]:
df.groupby(['A']).apply(lambda x:x.max())

       A    B         C         D
A
bar  bar  two  1.070365  0.645565
foo  foo  two  2.181589  1.779093

# Reshaping

In [85]:
tuples = list(
    zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
          ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [86]:
index=pd.MultiIndex.from_tuples(tuples,names=['first','seconde'])
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'seconde'])

In [88]:
df = pd.DataFrame(np.random.randn(8,2),index=index,columns=['A','B'])

In [92]:
df

                      A         B
first seconde
bar   one      2.313100  0.989176
      two     -0.436294  0.100511
baz   one     -0.969544 -1.681889
      two      0.732442 -1.446818
foo   one      1.095184  0.465005
      two     -0.091795 -1.055003
qux   one     -1.708138  0.457928
      two      0.271682  1.696289

In [98]:
stacked = df.stack()
stacked

first  seconde
bar    one      A    2.313100
                B    0.989176
       two      A   -0.436294
                B    0.100511
baz    one      A   -0.969544
                B   -1.681889
       two      A    0.732442
                B   -1.446818
foo    one      A    1.095184
                B    0.465005
       two      A   -0.091795
                B   -1.055003
qux    one      A   -1.708138
                B    0.457928
       two      A    0.271682
                B    1.696289
dtype: float64

In [99]:
stacked.unstack()

                      A         B
first seconde
bar   one      2.313100  0.989176
      two     -0.436294  0.100511
baz   one     -0.969544 -1.681889
      two      0.732442 -1.446818
foo   one      1.095184  0.465005
      two     -0.091795 -1.055003
qux   one     -1.708138  0.457928
      two      0.271682  1.696289

# Pivot Tables

In [101]:
df = pd.DataFrame({
    'A': ['one', 'one', 'two', 'three'] * 3,
    'B': ['A', 'B', 'C'] * 4,
    'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
    'D': np.random.randn(12),
    'E': np.random.randn(12)
})
df

        A  B    C         D         E
0     one  A  foo -1.332689 -0.415468
1     one  B  foo  0.278958  0.070907
2     two  C  foo  0.609932 -0.938172
3   three  A  bar -0.652113  0.865962
4     one  B  bar -0.008492 -1.125017
5     one  C  bar  0.565850 -0.720342
6     two  A  foo  1.360414  0.196655
7   three  B  foo  0.296454 -1.492767
8     one  C  foo  2.029344  0.104772
9     one  A  bar -0.712928  0.581094
10    two  B  bar -0.787932 -0.145181
11  three  C  bar -1.177740 -1.390558

In [106]:
pd.pivot_table(df,index=['A','B'],values='E',columns=['C'])

C             bar       foo
A     B
one   A  0.581094 -0.415468
      B -1.125017  0.070907
      C -0.720342  0.104772
three A  0.865962       NaN
      B       NaN -1.492767
      C -1.390558       NaN
two   A       NaN  0.196655
      B -0.145181       NaN
      C       NaN -0.938172

# Time Series

In [109]:
rng=pd.date_range('2012-01-01',periods=100,freq='S')
rng[:5]

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04'],
              dtype='datetime64[ns]', freq='S')

In [112]:
ts=pd.Series(np.random.randint(0,500,len(rng)),index=rng)
ts[:5]

2012-01-01 00:00:00    472
2012-01-01 00:00:01    238
2012-01-01 00:00:02    496
2012-01-01 00:00:03    422
2012-01-01 00:00:04    151
Freq: S, dtype: int32

In [121]:
ts.resample('1Min').sum()

2012-01-01 00:00:00    17028
2012-01-01 00:01:00     9766
Freq: T, dtype: int32

**Time zone representation**

In [125]:
rng=pd.date_range('2019-07-01',periods=5,freq='D')
ts=pd.Series(np.random.randn(len(rng)),rng)
ts

2019-07-01    0.594704
2019-07-02    0.956215
2019-07-03    0.577029
2019-07-04   -1.352849
2019-07-05    0.175572
Freq: D, dtype: float64

In [126]:
ts_utc=ts.tz_localize('UTC')
ts_utc

2019-07-01 00:00:00+00:00    0.594704
2019-07-02 00:00:00+00:00    0.956215
2019-07-03 00:00:00+00:00    0.577029
2019-07-04 00:00:00+00:00   -1.352849
2019-07-05 00:00:00+00:00    0.175572
Freq: D, dtype: float64

**Converting to another time zone**

In [128]:
ts_utc.tz_convert('US/Eastern')

2019-06-30 20:00:00-04:00    0.594704
2019-07-01 20:00:00-04:00    0.956215
2019-07-02 20:00:00-04:00    0.577029
2019-07-03 20:00:00-04:00   -1.352849
2019-07-04 20:00:00-04:00    0.175572
Freq: D, dtype: float64

**Converting between time span representations**

In [129]:
rng=pd.date_range('2019-07-01',periods=5,freq='M')
rng

DatetimeIndex(['2019-07-31', '2019-08-31', '2019-09-30', '2019-10-31',
               '2019-11-30'],
              dtype='datetime64[ns]', freq='M')

In [130]:
ts=pd.Series(np.random.randn(len(rng)),rng)
ts

2019-07-31    1.082076
2019-08-31    0.895077
2019-09-30    0.478684
2019-10-31   -1.399296
2019-11-30   -0.276381
Freq: M, dtype: float64

In [132]:
ps = ts.to_period()
ps

2019-07    1.082076
2019-08    0.895077
2019-09    0.478684
2019-10   -1.399296
2019-11   -0.276381
Freq: M, dtype: float64

In [133]:
ps.to_timestamp()

2019-07-01    1.082076
2019-08-01    0.895077
2019-09-01    0.478684
2019-10-01   -1.399296
2019-11-01   -0.276381
Freq: MS, dtype: float64

In [137]:
prng = pd.period_range('1990Q1', '2000Q4', freq='Q-NOV')
ts = pd.Series(np.random.randn(len(prng)), prng)
ts[:5]

1990Q1    0.996189
1990Q2   -0.180613
1990Q3   -0.090910
1990Q4   -1.557950
1991Q1   -1.255653
Freq: Q-NOV, dtype: float64

In [147]:
# asfreq
ts.index = (prng.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head()

1990-03-01 09:00    0.996189
1990-06-01 09:00   -0.180613
1990-09-01 09:00   -0.090910
1990-12-01 09:00   -1.557950
1991-03-01 09:00   -1.255653
Freq: H, dtype: float64

# Categoricals

In [148]:
df=pd.DataFrame(dict(id=range(1,7),raw_grade=list('abbaae')))
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [150]:
df['grade']=df['raw_grade'].astype('category')
df['grade']

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [154]:
df['grade'].cat.categories=['very good','good','very bad']
df['grade']

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (3, object): [very good, good, very bad]

In [174]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"])
df['grade']

TypeError: 'list' object is not callable

TypeError: 'list' object is not callable

In [179]:
df.sort_values(by='grade')

   id raw_grade      grade
0   1         a  very good
3   4         a  very good
4   5         a  very good
1   2         b       good
2   3         b       good
5   6         e   very bad

In [180]:
df.groupby('grade').size()

grade
very good    3
good         2
very bad     1
dtype: int64